sysbench/oltp_read_write_baseline.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 32 tps: 169.64 qps: 3433.40 (r/w/o: 2408.36/682.66/342.38) lat (ms,99%): 1739.68 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 32 tps: 228.80 qps: 4570.00 (r/w/o: 3198.97/913.42/457.61) lat (ms,99%): 200.47 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 221.93 qps: 4445.15 (r/w/o: 3112.56/888.63/443.97) lat (ms,99%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 231.99 qps: 4630.18 (r/w/o: 3239.15/927.26/463.78) lat (ms,99%): 179.94 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 32 tps: 226.40 qps: 4529.55 (r/w/o: 3170.76/905.99/452.79) lat (ms,99%): 179.94 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 228.91 qps: 4571.80 (r/w/o: 3199.27/914.82/457.71) lat (ms,99%): 179.94 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 32 tps: 229.00 qps: 4597.06 (r/w/o: 3219.44/919.61/458.01) lat (ms,99%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 32 tps: 228.00 qps: 4551.66 (r/w/o: 3187.27/908.09/456.30) lat (ms,99%): 179.94 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 32 tps: 224.10 qps: 4487.18 (r/w/o: 3140.06/898.92/448.21) lat (ms,99%): 186.54 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 32 tps: 222.07 qps: 4439.35 (r/w/o: 3108.81/886.59/443.94) lat (ms,99%): 183.21 err/s: 0.00 reconn/s: 0.00
Latency histogram (values are in milliseconds)
       value  ------------- distribution ------------- count
      95.814 |                                         1
      97.555 |                                         1
      99.327 |                                         1
     101.132 |                                         4
     102.969 |                                         4
     104.840 |                                         8
     106.745 |                                         19
     108.685 |*                                        22
     110.659 |**                                       71
     112.670 |***                                      106
     114.717 |****                                     178
     116.802 |******                                   270
     118.924 |**********                               402
     121.085 |*************                            540
     123.285 |******************                       750
     125.525 |**********************                   909
     127.805 |**************************               1072
     130.128 |*******************************          1292
     132.492 |**********************************       1444
     134.899 |***************************************  1621
     137.350 |***************************************  1653
     139.846 |**************************************** 1675
     142.387 |**************************************   1581
     144.974 |************************************     1504
     147.608 |********************************         1327
     150.290 |**************************               1089
     153.021 |***********************                  982
     155.801 |********************                     827
     158.632 |****************                         674
     161.514 |************                             517
     164.449 |**********                               404
     167.437 |******                                   267
     170.479 |*****                                    228
     173.577 |****                                     173
     176.731 |***                                      125
     179.942 |**                                       95
     183.211 |*                                        58
     186.540 |*                                        51
     189.929 |*                                        37
     193.380 |*                                        25
     196.894 |                                         19
     200.472 |                                         13
     204.114 |                                         8
     207.823 |                                         6
     211.599 |                                         7
     215.443 |                                         8
     219.358 |                                         5
     223.344 |                                         1
     227.402 |                                         2
     257.950 |                                         1
    1032.013 |                                         10
    1050.764 |                                         15
    1069.856 |                                         1
    1089.295 |                                         1
    1109.087 |                                         1
    1129.239 |                                         1
    1149.757 |                                         2
    1170.648 |                                         1
    1708.634 |                                         10
    1739.679 |*                                        21
    1771.289 |                                         1
 
SQL statistics:
    queries performed:
        read:                            309974
        write:                           88564
        other:                           44282
        total:                           442820
    transactions:                        22141  (221.16 per sec.)
    queries:                             442820 (4423.29 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          100.1095s
    total number of events:              22141

Latency (ms):
         min:                                   95.48
         avg:                                  144.60
         max:                                 1758.51
         99th percentile:                      186.54
         sum:                              3201669.31

Threads fairness:
    events (avg/stddev):           691.9062/2.17
    execution time (avg/stddev):   100.0522/0.03