sysbench/oltp_read_write_flexible.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 32 tps: 203.33 qps: 4105.80 (r/w/o: 2879.15/816.80/409.85) lat (ms,99%): 204.11 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 32 tps: 199.82 qps: 3996.14 (r/w/o: 2796.74/799.77/399.63) lat (ms,99%): 215.44 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 189.70 qps: 3793.09 (r/w/o: 2655.76/757.92/379.41) lat (ms,99%): 257.95 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 195.71 qps: 3915.03 (r/w/o: 2740.46/783.15/391.42) lat (ms,99%): 211.60 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 32 tps: 194.30 qps: 3882.94 (r/w/o: 2718.26/776.09/388.59) lat (ms,99%): 215.44 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 192.69 qps: 3851.20 (r/w/o: 2695.96/769.96/385.28) lat (ms,99%): 211.60 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 32 tps: 191.11 qps: 3833.78 (r/w/o: 2684.10/767.36/382.33) lat (ms,99%): 219.36 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 32 tps: 193.19 qps: 3849.79 (r/w/o: 2693.56/769.86/386.38) lat (ms,99%): 219.36 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 32 tps: 185.41 qps: 3720.08 (r/w/o: 2605.42/743.94/370.72) lat (ms,99%): 235.74 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 32 tps: 182.00 qps: 3642.91 (r/w/o: 2549.34/729.48/364.09) lat (ms,99%): 227.40 err/s: 0.00 reconn/s: 0.00
Latency histogram (values are in milliseconds)
       value  ------------- distribution ------------- count
     106.745 |                                         3
     110.659 |                                         2
     112.670 |                                         2
     114.717 |                                         3
     116.802 |                                         6
     118.924 |                                         10
     121.085 |                                         16
     123.285 |*                                        33
     125.525 |*                                        44
     127.805 |**                                       73
     130.128 |****                                     124
     132.492 |*****                                    161
     134.899 |*******                                  221
     137.350 |**********                               309
     139.846 |*************                            435
     142.387 |****************                         509
     144.974 |*********************                    690
     147.608 |**************************               849
     150.290 |****************************             900
     153.021 |**********************************       1108
     155.801 |************************************     1160
     158.632 |**************************************** 1289
     161.514 |**************************************** 1297
     164.449 |***************************************  1271
     167.437 |**************************************   1241
     170.479 |************************************     1177
     173.577 |*********************************        1080
     176.731 |*****************************            956
     179.942 |**************************               842
     183.211 |***********************                  743
     186.540 |*****************                        567
     189.929 |**************                           445
     193.380 |************                             405
     196.894 |**********                               330
     200.472 |*******                                  226
     204.114 |******                                   188
     207.823 |****                                     134
     211.599 |***                                      98
     215.443 |**                                       73
     219.358 |**                                       60
     223.344 |*                                        46
     227.402 |*                                        45
     231.534 |*                                        23
     235.740 |*                                        33
     240.024 |                                         11
     244.385 |                                         13
     248.825 |                                         8
     253.346 |                                         10
     257.950 |                                         8
     262.636 |                                         6
     267.408 |                                         9
     272.267 |                                         3
     277.214 |                                         2
     282.251 |                                         2
     287.379 |                                         1
     292.601 |                                         2
     303.330 |                                         3
 
SQL statistics:
    queries performed:
        read:                            270270
        write:                           77220
        other:                           38610
        total:                           386100
    transactions:                        19305  (192.81 per sec.)
    queries:                             386100 (3856.14 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          100.1244s
    total number of events:              19305

Latency (ms):
         min:                                  106.47
         avg:                                  165.85
         max:                                  305.43
         99th percentile:                      223.34
         sum:                              3201698.11

Threads fairness:
    events (avg/stddev):           603.2812/2.35
    execution time (avg/stddev):   100.0531/0.03